[
  {
    "objection": "I don't have the money for this.",
    "rebuttal": "Show how the monthly increase far outweighs the small one-time fee.",
    "proof": "Average veteran gains $400-$1,200 more per month after proper evidence support.",
    "tags": ["financial","cost","pricing"]
  },
  {
    "objection": "The fee is too high.",
    "rebuttal": "Reframe cost as investment toward lifetime tax-free income.",
    "proof": "Explain that a single successful claim can pay back the service fee within months.",
    "tags": ["financial","pricing"]
  },
  {
    "objection": "Can I pay after I get approved?",
    "rebuttal": "Clarify that providers and record specialists must be paid up-front to begin work.",
    "proof": "Processing and medical documentation can’t start until the case file is active.",
    "tags": ["financial","process"]
  },
  {
    "objection": "I don't want to waste money if it doesn’t work.",
    "rebuttal": "Share success data and emphasize documented evidence strategy.",
    "proof": "TYFYS cases use licensed medical providers and DBQs linked to results.",
    "tags": ["financial","trust"]
  },
  {
    "objection": "Why pay when VSOs and DAVs are free?",
    "rebuttal": "Explain difference between volume-based assistance and evidence-driven representation.",
    "proof": "VSOs file forms; TYFYS builds full medical documentation and nexus letters.",
    "tags": ["financial","vso"]
  },
  {
    "objection": "Lawyers do this for a percentage.",
    "rebuttal": "Clarify that lawyers enter only after a denial and often take 20-30% of back pay.",
    "proof": "We work before appeals to help you avoid that stage entirely.",
    "tags": ["financial","lawyer"]
  },
  {
    "objection": "How do I know this isn’t a scam?",
    "rebuttal": "Build trust through transparency, veteran ownership, and verified partners.",
    "proof": "TYFYS is veteran-led with public business registration and HIPAA-secure platform.",
    "tags": ["trust","legitimacy"]
  },
  {
    "objection": "Why should I trust you over the VA or a VSO?",
    "rebuttal": "Position as a teammate, not a replacement.",
    "proof": "We complement the VA process with private evidence VSOs can’t provide.",
    "tags": ["trust","vso"]
  },
  {
    "objection": "What makes you qualified to help me?",
    "rebuttal": "Highlight prior-service staff, medical partners, and thousands of successful claims.",
    "proof": "Every coordinator passes VA-claim certification and veteran-specific training.",
    "tags": ["trust","expertise"]
  },
  {
    "objection": "Are you actually veterans?",
    "rebuttal": "Confirm proudly that the team is veteran-owned and staffed by prior service.",
    "proof": "Our mission exists because we lived through the same frustration ourselves.",
    "tags": ["trust","credibility"]
  },
  {
    "objection": "How do I know my information is safe?",
    "rebuttal": "Reassure with HIPAA compliance and encrypted systems.",
    "proof": "All medical files are stored on HIPAA-secured cloud servers with limited access.",
    "tags": ["trust","security"]
  },
  {
    "objection": "I don’t want to risk losing what I already have.",
    "rebuttal": "Explain protections within VA review rules and evidence-based increases.",
    "proof": "If medical evidence supports an increase, reduction is statistically rare.",
    "tags": ["fear","risk"]
  },
  {
    "objection": "What if my rating goes down?",
    "rebuttal": "Show that solid medical documentation prevents that scenario.",
    "proof": "Our process reviews records before filing to ensure only supported increases.",
    "tags": ["fear","risk"]
  },
  {
    "objection": "I don’t want to make things worse with the VA.",
    "rebuttal": "Clarify that submitting correct documentation improves accuracy, not conflict.",
    "proof": "VA encourages veterans to provide complete medical evidence.",
    "tags": ["fear","va"]
  },
  {
    "objection": "I don’t want to give the wrong answer and mess things up.",
    "rebuttal": "Remind them TYFYS prepares and coaches them for each step.",
    "proof": "We guide every question so responses are honest and clear—not risky.",
    "tags": ["fear","process"]
  },
  {
    "objection": "I’m afraid to reopen my claim.",
    "rebuttal": "Normalize that fear and explain the benefits of updated medical data.",
    "proof": "Reopening with new evidence often unlocks compensation they’ve earned.",
    "tags": ["fear","reopen"]
  },
  {
    "objection": "Why does this take so long?",
    "rebuttal": "Be transparent about VA timelines while emphasizing TYFYS speed on evidence.",
    "proof": "Average claim time drops from 9-12 months to 4-6 months with organized documentation.",
    "tags": ["time","process"]
  },
  {
    "objection": "How long until I see results?",
    "rebuttal": "Set realistic expectation but refocus on getting started.",
    "proof": "Filing now starts the compensation clock today rather than months from now.",
    "tags": ["time","urgency"]
  },
  {
    "objection": "Why is it so hard to get an appointment?",
    "rebuttal": "Show that TYFYS handles scheduling directly with private providers.",
    "proof": "No need to wait on VA backlog; telehealth slots open weekly.",
    "tags": ["time","appointments"]
  },
  {
    "objection": "I’ve been denied so many times, I don’t want to go through it again.",
    "rebuttal": "Empathize and explain what’s different this time—evidence and support.",
    "proof": "We study your past denial letter line-by-line to fix missing evidence.",
    "tags": ["time","denial","hope"]
  },
  {
    "objection": "Other soldiers deserve it more than me.",
    "rebuttal": "Affirm their humility but remind them compensation is based on condition, not comparison.",
    "proof": "Every veteran earned benefits equally under law; no one’s relief takes from another.",
    "tags": ["self-doubt","guilt"]
  },
  {
    "objection": "I’m not that bad off.",
    "rebuttal": "Clarify that ratings reflect medical facts, not toughness.",
    "proof": "Even mild chronic pain or sleep issues qualify for partial ratings.",
    "tags": ["self-doubt","minimizing"]
  },
  {
    "objection": "I’ve learned to live with it.",
    "rebuttal": "Explain that living with pain doesn’t mean they must suffer without benefits.",
    "proof": "Compensation exists to improve quality of life, not just to survive discomfort.",
    "tags": ["self-doubt","acceptance"]
  },
  {
    "objection": "I don’t want 100% because I still want to work.",
    "rebuttal": "Clarify difference between disability rating and unemployability.",
    "proof": "Most veterans with 100% schedular ratings still work full time.",
    "tags": ["self-doubt","work"]
  },
  {
    "objection": "I’m older now—what’s the point?",
    "rebuttal": "Show long-term family benefit of back pay and survivor compensation.",
    "proof": "Compensation continues to spouse if veteran passes with rated condition.",
    "tags": ["self-doubt","age"]
  },
  {
    "objection": "The system is rigged. It’s not worth trying.",
    "rebuttal": "Acknowledge frustration but show proof that persistence wins with proper documentation.",
    "proof": "Over 70% of appeals succeed once evidence and medical opinions are corrected.",
    "tags": ["burnout","hopelessness"]
  },
  {
    "objection": "I already tried doing it myself for years.",
    "rebuttal": "Validate effort, then show how professional evidence changes outcomes.",
    "proof": "Self-filed claims rarely include nexus letters or medical rationale.",
    "tags": ["burnout","self-help"]
  },
  {
    "objection": "The VA never listens.",
    "rebuttal": "Agree that it feels that way but remind them documentation forces attention.",
    "proof": "When DBQs are completed by licensed providers, VA must review them by law.",
    "tags": ["burnout","trust"]
  },
  {
    "objection": "It’s a headache to deal with all the paperwork.",
    "rebuttal": "Show relief: TYFYS handles the paperwork end-to-end.",
    "proof": "Veterans simply review and e-sign—no faxing or mailing required.",
    "tags": ["burnout","process"]
  },
  {
    "objection": "Nothing ever changes. It’s all a waste of time.",
    "rebuttal": "Share quick-win stories and explain how new evidence laws made the process faster.",
    "proof": "PACT Act and new presumptives dramatically expanded approval rates since 2022.",
    "tags": ["burnout","hopelessness"]
  },
  {
    "objection": "I’m tired of fighting this battle.",
    "rebuttal": "Acknowledge exhaustion but paint hope with a guided team approach.",
    "proof": "You don’t have to fight alone anymore—our coordinators handle the heavy lifting.",
    "tags": ["burnout","fatigue"]
  }
]
